config/look-and-feel/org-faces.org
#+title: Org Mode Faces Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle org-faces.el
#+auto_tangle: y

* Introduction
This file configures the appearance of Org mode, adjusting font sizes and styles for headings and other elements.

* Basic Configuration
Setup lexical binding for better closures and variable scoping.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

* Org Mode Display Settings
Configure general display settings for Org mode.

#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
(setq org-hide-leading-stars t)
(setq org-startup-indented t)

;; this setting will break capture templates 
;;(setq org-blank-before-new-entry nil)
#+end_src

* Org Heading Faces
Customize the appearance of Org mode headings.

#+begin_src emacs-lisp
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(org-level-1 ((t (:inherit outline-1 :height 2.0))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.75))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.5))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
 '(org-level-5 ((t (:inherit outline-5 :height 1.0)))))
#+end_src

* Usage Notes
These settings provide:

- Cleaner org files by hiding emphasis markers (*, /, _, etc.)
- Cleaner headings by hiding leading stars
- Indented view by default
- Graduated heading sizes with level 1 being largest (2x normal size)
- Level 4 and 5 headings at normal text size

* TODO Improvements
- Consider different font families for headings
- Add custom faces for org blocks, lists, and tables
- Create a unified appearance with the active theme
- Add variable-pitch mode for prose sections